artillerytest.yaml
config: 
    target: "https://restful-booker.herokuapp.com"
    phases:
        - duration: 10
          arrivalRate: 10
          rampTo: 100
          name: ramp-up
        - duration: '10m'
          arrivalRate: 100
          name: plateau
    plugins:
        ensure: {}
        apdex: {}
        metrics-by-endpoint: {}
        fake-data: {}
    apdex:
        threshold: 100
    ensure:
        thresholds:
        - http.response_time.p99: 5000
        - http.response_time.p95: 4000

scenarios:
    - flow:
        - loop:
            - get:
                url: '/booking'
            - post:
                url: '/booking'
                headers:
                    Content-Type: 'application/json'
                    Accept: 'application/json'
                json:
                    firstname: "{{ $randFullName() }}"
                    lastname: "{{ $randFullName() }}"
                    totalprice: "{{ $randNumber({min: 1, max:1000}) }}"
                    depositpaid: "{{ $randBoolean() }}"
                    bookingdates:
                        checkin: "randBetweenDate({ from: new Date('10/07/2025'), to: new Date() })"
                        checkout: "randBetweenDate({ from: new Date('10/07/2025'), to: new Date(), length: 10 })"
                    additionalneeds: "randDrinks({ length: 10 })"    
          count: 1